CSI API ETABS v1
cDesignCompositeBeam.GetComboDeflection Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetComboDeflection(
	ref int NumberItems,
	ref string[] MyName
)
Function GetComboDeflection (
	ByRef NumberItems As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cDesignCompositeBeam
Dim NumberItems As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.GetComboDeflection(NumberItems,
	MyName)
int GetComboDeflection(
	int% NumberItems,
	array<String^>^% MyName
)
abstract GetComboDeflection :
        NumberItems : int byref *
        MyName : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
MyName
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignCompositeBeam Interface
ETABSv1 Namespace